000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PROCESSA.
000300 AUTHOR. LPCOUTINHO.
000400*----------------------------------------------------------------*
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SPECIAL-NAMES.
000800     DECIMAL-POINT IS COMMA.
000900
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
001200     SELECT ARQUIVO-REMESSA ASSIGN TO 'data/input/remessa.txt'
001300     ORGANIZATION IS LINE SEQUENTIAL.
001400
001500 DATA DIVISION.
001600 FILE SECTION.
001700 FD  ARQUIVO-REMESSA.
001800 01  REGISTRO-REMESSA.
001900     05 ID-TRANSACAO   PIC 9(05).
002000     05 DATA-TRANSACAO PIC 9(08).
002100     05 VALOR          PIC 9(05)V99.
002200     05 TIPO           PIC X(01).
002300
002400 WORKING-STORAGE SECTION.
002500 01  FILLER            PIC X(15) VALUE 'VARIAVEIS-CONT'.
002600 01  FIM-DO-ARQUIVO    PIC X(01) VALUE 'N'.
002700 01  TOTAL-CREDITOS    PIC 9(07)V99 VALUE ZEROS.
002800 01  TOTAL-DEBITOS     PIC 9(07)V99 VALUE ZEROS.
002900 01  MOSTRA-VALOR      PIC ZZZ.ZZ9,99.
003000 01  MOSTRA-CREDITOS   PIC ZZZ.ZZ9,99.
003100 01  MOSTRA-DEBITOS    PIC ZZZ.ZZ9,99.
003200
003300 PROCEDURE DIVISION.
003400 0000-PRINCIPAL.
003500     OPEN INPUT ARQUIVO-REMESSA.
003600
003700     PERFORM UNTIL FIM-DO-ARQUIVO = 'S'
003800         READ ARQUIVO-REMESSA
003900             AT END
004000                 MOVE 'S' TO FIM-DO-ARQUIVO
004100             NOT AT END
004200                 PERFORM 1000-PROCESSA-REGISTRO
004300         END-READ
004400     END-PERFORM.
004500
004600     PERFORM 2000-MOSTRA-TOTAIS.
004700     CLOSE ARQUIVO-REMESSA.
004800     STOP RUN.
004900
005000 1000-PROCESSA-REGISTRO.
005100     MOVE VALOR TO MOSTRA-VALOR.
005200     DISPLAY "ID: " ID-TRANSACAO " | VALOR: R$ " MOSTRA-VALOR.
005300
005400     IF TIPO = 'C'
005500         ADD VALOR TO TOTAL-CREDITOS
005600     ELSE
005700         ADD VALOR TO TOTAL-DEBITOS
005800     END-IF.
005900
006000 2000-MOSTRA-TOTAIS.
006100     MOVE TOTAL-CREDITOS TO MOSTRA-CREDITOS.
006200     MOVE TOTAL-DEBITOS TO MOSTRA-DEBITOS.
006300     DISPLAY "-----------------------------------".
006400     DISPLAY "TOTAL CREDITOS : R$ " MOSTRA-CREDITOS.
006500     DISPLAY "TOTAL DEBITOS  : R$ " MOSTRA-DEBITOS.
006600     DISPLAY "-----------------------------------".
